from collections import defaultdict


technic = [
    ('Ноутбук', 1500, 'Татьяна', '89002001020'),
    ('Смартфон', 500, 'Анна', '89202202325'),
    ('Проектор', 300, 'Андрей', '89505205656'),
    ('Принтер', 750, 'Игорь', '89303303236'),
    ('Планшет', 2300, 'Игорь', '89303303236'),
    ('Смартфон', 1000, 'Андрей', '89505205656'),
    ('Ноутбук', 4800, 'Татьяна', '89002001020'),
    ('Наушники', 780, 'Марина', '89562002350'),
    ('Сканер', 550, 'Сергей', '89808564559'),
    ('Планшет', 1200, 'Анна', '89202202325'),
    ('Ноутбук', 1100, 'Игорь', '89303303236'),
    ('Смартфон', 3500, 'Татьяна', '89002001020'),
]


def convert_data(data):
    res = defaultdict(list)

    for item in data:
        res[f'{item[2]} {item[3]}'].append(f'{item[0]} - {item[1]}')
    return res


def print_technic():
    data = convert_data(technic)
    for k, v in data.items():
        print(k, end=': ')
        print(*v, sep='; ')
